app/Controllers/Owner/StokBarangController.php

    public function index()
    {
        $model = new StokBarangModel();
        $data['stok'] = $model->findAll();
---
SELECT *
FROM `stok_barang`