app/Controllers/SuperAdmin/BranchController.php

SELECT *
FROM `branches`
---
    public function index()
    {
        $branches = $this->db->table('branches')->get()->getResultArray();