app/Controllers/SuperAdmin/Dashboard.php

    public function index()
    {
        $db = \Config\Database::connect();
        $totalUsers = $db->table('users')->countAllResults();
        $totalBranches = $db->table('branches')->countAllResults();

        $categoryModel = new CategoryModel();
        $totalActiveProducts = $categoryModel->selectSum('total_stock')
            ->where('status', 'aktif')
            ->first();
---
SELECT COUNT(*) AS `numrows`
FROM `users`
SELECT COUNT(*) AS `numrows`
FROM `branches`
SELECT SUM(`total_stock`) AS `total_stock`
FROM `categories`
WHERE `status` = 'aktif'
 LIMIT 1