app/Controllers/SuperAdmin/ItemController.php

    public function index()
    {
        $data['items'] = $this->itemModel->findAll();
        $categoryModel = new CategoryModel();
        $data['categories'] = $categoryModel->findAll();
---
SELECT *
FROM `items`
SELECT *
FROM `categories`