app/Controllers/Feedbacks.php

    public function index()
    {
        $feedbackModel = new FeedbackModel();
        $feedbacks = $feedbackModel->orderBy('id', 'DESC')->findAll();
---
SELECT *
FROM `feedbacks`
ORDER BY `id` DESC