app/Controllers/Pages.php

SELECT *
FROM `feedbacks`
ORDER BY `id` DESC
---
    public function index()
    {
        $feedbackModel = new FeedbackModel();
        $feedbacks = $feedbackModel->orderBy('id', 'DESC')->findAll();