app/Models/CategoryModel.php

    public function getCategoriesWithItemCount()
    {
        // Use Query Builder to select categories and count items per category by joining with items table
        $builder = $this->db->table('categories');
        $builder->select('categories.*, COUNT(items.id) AS item_count');
        $builder->join('items', 'items.kategori = categories.code', 'left');
        $builder->groupBy('categories.id');
        return $builder->get()->getResultArray();
---
SELECT `categories`.*, COUNT(items.id) AS item_count
FROM `categories`
LEFT JOIN `items` ON `items`.`kategori` = `categories`.`code`
GROUP BY `categories`.`id`