app/Models/NotificationModel.php

SELECT *
FROM `notifications`
WHERE `is_read` = 0
ORDER BY `created_at` DESC
---
    public function getUnreadNotifications($userId = null)
    {
        $builder = $this->where('is_read', 0);

        if ($userId) {
            $builder->where('user_id', $userId);
        }

        return $builder->orderBy('created_at', 'DESC')->findAll();

SELECT *
FROM `notifications`
ORDER BY `created_at` DESC
 LIMIT 20
---
    public function getNotifications($userId = null, $limit = 10)
    {
        $builder = $this;

        if ($userId) {
            $builder->where('user_id', $userId);
        }

        return $builder->orderBy('created_at', 'DESC')->findAll($limit);